{
  "portfolio": [
    {
      "projectName": "CV",
      "description": "<p>Адаптований для перегляну на мобайл-таблет-десктоп пристроях. Всі компоненти проходять перевірку ПропТупес, а також покриті тестами.</p>",
      "links": [
        {
          "iconId": "figma",
          "name": "Maket",
          "url": "https://www.figma.com/file/RDlQxmX94XD7TZvDuRsB4j/CV?node-id=0%3A1",
          "color": "figma"
        },
        {
          "iconId": "gitHub",
          "name": "Code",
          "url": "https://github.com/oleksiikoko/CV",
          "color": "blue"
        },
        {
          "iconId": "heroku",
          "name": "Deploy",
          "url": "http://localhost:3000/",
          "color": "purple"
        }
      ]
    },
    {
      "projectName": "Joke generator",
      "description": "<p>Сервіс для генерації та пошуку жартів. Для отримання ногово досвіду і кращого розуміння Js за основну техонологі було взято Vanilla.js</p>",
      "gif": {
        "path": "src/assets/PortfolioGifPreview/JokeGeneratorPreview.gif",
        "duration": 12000,
        "width": 800,
        "height": 395
      },
      "links": [
        {
          "iconId": "figma",
          "name": "Maket",
          "url": "https://www.figma.com/file/tXQ7qBjtlVZgaleoU4Yiqm/MSI-2020---Front-end-Development-Test?node-id=0%3A1",
          "color": "figma"
        },
        {
          "iconId": "gitHub",
          "name": "Code",
          "url": "https://github.com/oleksiikoko/Joke-Generator",
          "color": "blue"
        },
        {
          "iconId": "heroku",
          "name": "Deploy",
          "url": "https://mac-paw-internship.herokuapp.com/",
          "color": "purple"
        }
      ]
    },
    {
      "projectName": "GitHub search",
      "description": "<p>Пошукова сторінка гітхаб, створена з Дизайну гіт, використання стороннього апі а саме гітАпі.</p>",
      "gif": {
        "path": "src/assets/PortfolioGifPreview/GitHubSearchPreview.gif",
        "duration": 4000,
        "width": 600,
        "height": 552
      },
      "links": [
        {
          "iconId": "gitHub",
          "name": "Code",
          "url": "https://github.com/oleksiikoko/GitHub-Search",
          "color": "blue"
        },
        {
          "iconId": "heroku",
          "name": "Deploy",
          "url": "https://better-me-test.herokuapp.com/",
          "color": "purple"
        }
      ]
    },
    {
      "projectName": "User statistics",
      "description": "<p>В проекту є 3 основі стани, лендінг, таблиця з даними юзерів, та грфіки для демонстрації активності.</p>",
      "gif": {
        "path": "src/assets/PortfolioGifPreview/UserStatisticPreview.gif",
        "duration": 7000,
        "width": 800,
        "height": 393
      },
      "links": [
        {
          "iconId": "figma",
          "name": "Maket",
          "url": "https://www.figma.com/file/LpWuCx7YkPctSdSVwAKflI/Untitled",
          "color": "figma"
        },
        {
          "iconId": "gitHub",
          "name": "Code",
          "url": "https://github.com/oleksiikoko/User-Statistics",
          "color": "blue"
        }
      ]
    },
    {
      "projectName": "TicTacToe",
      "description": "<p>Гра хрестики-нулики де противником може бути як жива людина так і бот. Це є моїм першим авторським проектом задача якого була - застосування набутих навичок в React/Redux/Node.js. Проблеми: <ul><li>Відсутня адаптивна верстка</li><li>Важкий для розуміння код</li><li>Заплутана логіка</li><ul></p>",
      "gif": {
        "path": "src/assets/PortfolioGifPreview/TicTacToePreview.gif",
        "duration": 10000,
        "width": 800,
        "height": 393
      },
      "links": [
        {
          "iconId": "figma",
          "name": "Maket",
          "url": "https://www.figma.com/file/EBFJ5hHfV4CnJridemzPcU/TicTacToe",
          "color": "figma"
        },
        {
          "iconId": "gitHub",
          "name": "Code",
          "url": "https://github.com/oleksiikoko/TicTacToe",
          "color": "blue"
        },
        {
          "iconId": "heroku",
          "name": "Deploy",
          "url": "https://pet-tictactoe.herokuapp.com/",
          "color": "purple"
        }
      ]
    }
  ],
  "about": {
    "text": "<p> Mostly, I'm looking for a company that appreciates and strongly concentrate freethinkers in addition to courageous people, as well as the promotion of diverse development of workers specifically on the position of \"Front-end developer\" I want to be engaged in the vast majority of the development of \"logic\" on Js/React, markup(HTML, CSS) does not frighten me, assuming that it will occupy no more than 40% of tasks related.</p>"
  },
  "contacts": [
    {
      "iconId": "phone",
      "contact": "+380966138713"
    },
    {
      "iconId": "telegram",
      "contact": "@oleksii_ko",
      "href": "https://t.me/oleksii_ko"
    },
    {
      "iconId": "mail",
      "contact": "oleksiij.ko@gmail.com",
      "href": "mailto: oleksiij.ko@gmail.com"
    },
    {
      "iconId": "gitHub",
      "contact": "github.com/oleksiikoko",
      "href": "https://github.com/oleksiikoko"
    },
    {
      "iconId": "linkedin",
      "contact": "linkedin.com/in/oleksiiko",
      "href": "https://www.linkedin.com/in/oleksiiko/"
    },
    {
      "iconId": "skype",
      "contact": "live:oleksiij.ko"
    }
  ],
  "english": {
    "level": "Pre-Intermediate"
  },
  "experience": [
    {
      "companyName": "Blockchain-based mobile development startup - \"Extracoin/Etalonium\"",
      "position": "C++/Qt developer",
      "link": "https://etalonium.io/ ",
      "startDate": "2019-01-01",
      "endDate": "2019-12-01",
      "tasks": [
        {
          "task": "Decentralized application development"
        },
        {
          "task": "Multithreaded code execution"
        },
        {
          "task": "Finding and preventing memory leaks"
        },
        {
          "task": "Blockchain network support"
        }
      ]
    }
  ],
  "motivation": [
    {
      "text": "<p>Можна без кінця вести роздуми на те, яку сучасність ми маємо, як було раніше і що нас ще чекає.  Які виклики приймає людина в 21-му столітті, хоча в сучасному світі настільки швидко міняються правила... Тому взяти хоча б рік 2020, який видався надзвичайно насиченим на зміни. Людство повинно надзвичайно швидко реагувати та адаптуватись до всього нового. Що до мене, то мені 21, я 4 роки в Києві і я вражений цим життям, часом і місцем в якому я живу. </p><p>Цей час, дає мені можливості, про які я і не міг здогадуватись. Якщо говорити про можливості,  вони були завжди, і люди користувались ними, користувались щоб виживати, розвиватись, продувжувати рід, а в результаті знаходити те, що і уявити не могли. Осмислено чи ні, люди стали на шлях розвитку. Стоп, чи можемо ми в цьому плані виділить якось людей, чи відрізняємось ми від інших живих стоворіннь, з чого  зроблені вони а з чого ми. Наскільки ми можемо знати матеріал один. Щось з невідомими нам властивостями ми любимо назвати матерія, я називаю цю матерію життям. Воно оточує нас вскрізь. Ми самі є нею. Я це бачу як одне велике ціле, яке, щось, весь час шукає, і це з часом виливається в те, що ми можемо бачити і те чим ми власне являємось. Всі ми це відчуваємо, ці безкінечні пошуки. Мене надихає, той результат який ми можемо бачити зараз, те до чого привів пошук, і я хочу приймати в ньому участь.</p><p>В даний момент для мене буде дуже доречним сказати про одну річ, яка з'являється коли ми знаходимо щось нове, яку ми звикли називати жертвами. Можливо когось лякає це слово, і мене лякало, лякало те яким великими в площині мого буття речами я жертвую. Саме поняття яке вкладено в слово \"жертва\" це ознчає що ми повинні віддати, щоб отримати. І ніколи ми не знаємо, що отримаємо насправді. З практичної точки зору, я бачу жерви як спосіб отримання нового. Тобто в жертви завжи є друга друга сторона і дуже часто це і є нова можливість.</p><p>Є дуже багато речей, на яких людина повинна балансувати всь час щоб знаходити все нові і нові комбінації. Знову ж таки якщо розглядати в глобальному, то баланс одна з фундаментальних речей, яку можна побачити в як і в загальному законі рівноваги всесвіту так і в питанні повсякденного життя людей, баланс між роботою і особистим життям, власним захопленням і тим, чого потребує час і обставини, між  особистістю та її оточенням, між порядком і хаосом. І якщо складати рівння людського життя, то мені важко уявити як баланс може бути константою, навіть в точці повної рівноваги. Окей, що я тоді хочу сказати. Баланс - я розглядую як такий собі інструмент-індикатор. Коли ми переводимо якусь задачу в стан порядоку - це час коли потрібно зосередитись та зконцентруватись на вирішенні якось питання і підійти до його вирішення максимально холодно, професійно і монотонно. Хаос - це полігон для творчості, щось абсолютно нове, те що ламає всі плани і диктує нові правила. І на кінець точка рівноваги - в цій точці ми накопичуємо те, що зходимо в хаосі і порядку, це точка де в нас все готово і все добре, точка в яку ми зобов'язані вміти повертатись, щоб тримати баланс. </p>",
      "language": "Ukrainian"
    },
    {
      "text": "En motivation",
      "language": "English"
    }
  ],
  "skills": [
    {
      "text": "Understanding JavaScript strengths and weaknesses, <b>es5</b> and <b>es6</b> Standards"
    },
    {
      "text": "Manipulating a DOM model"
    },
    {
      "text": "Markup of adaptive, flexbox HTML pages using SCSS preprocessor following the BEM methodology"
    },
    {
      "text": "SPA application development using the React and React-router framework, implementation of the Redux state management tool"
    },
    {
      "text": "Creating RestApi with Node.js, using Express and mongoose to work with MongoDB"
    },
    {
      "text": "Writing clean, reusable, mutable code using OOP/OOD principles"
    },
    {
      "text": "Networking protocols: TCP/IP, HTTP"
    },
    {
      "text": "Linux"
    },
    {
      "text": "Git"
    }
  ],
  "education": [
    {
      "text": "Unit Factory pool",
      "description": "Was engaged in an intensive boot camp of C language course where everyone learns himself to work with strict deadlines and self-planning. Basics of networking. Introduction to Unix"
    },
    {
      "text": "NTUU \"Igor Sikorsky Kyiv Polytechnic Institute\"",
      "description": "Applied mathematics<i>(rejected)</i>"
    }
  ]
}